"""
Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
"""

if __name__ == '__main__':
    # 5 = 101 6 = 110
    print(f'5 | 6 = {5 | 6}')    # 101 | 110 -> 1|1 1|0 1|0 -> 111 -> 7
    print(f'5 & 6 = {5 & 6}')    # 101 & 110 -> 1&1 0&1 1&0 -> 100 -> 4
    print(f'5 ^ 6 = {5 ^ 6}')    # 101 ^ 110 -> 1^1 0^1 1^0 -> 011 -> 3
    print(f'~5 = {~ 5}')         # ~5 -> -6 как-то связано с изменением битов, отвечающих за знак, перед b
    print(f'~6 = {~ 6}')         # ~6 -> -7 но я не разобрался до конца
    print(f'5 << 2 = {5 << 2}')  # 101 << 2 -> 10100 -> 2 ^ 4 + 2 ^ 2 -> 20
    print(f'5 >> 2 = {5 >> 2}')  # 110 >> 2 -> 00001 -> 2 ^ 0         -> 1
    print(f'6 << 2 = {6 << 2}')  # 110 << 2 -> 11000 -> 2 ^ 4 + 2 ^ 3 -> 24
    print(f'6 >> 2 = {6 >> 2}')  # 110 >> 2 -> 00001 -> 2 ^ 0         -> 1
